Revit 2027 API
Document.TypeOfStorage Property
Get the storage type of the specified BuiltInParameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StorageType this[
	BuiltInParameter A_0
] { get; }
Public ReadOnly Property TypeOfStorage (
	A_0 As BuiltInParameter
) As StorageType
	Get
public:
property StorageType TypeOfStorage[BuiltInParameter A_0] {
	StorageType get (BuiltInParameter A_0);
}
member TypeOfStorage : StorageType with get
Parameters
A_0 BuiltInParameter
Property Value
StorageType
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace